In [1]:
from Utils.request import Request

request = Request()
import pandas as pd

In [2]:
data = request.get_restaurant()
data.loc[(data["city"]== "unknown")]

Empty DataFrame
Columns: [opening_hours, city, creation_date, id, street, email, phone_number, name]
Index: []

In [3]:
data = request.big_data

In [4]:
data.drop(data.loc[(data["city"] == "unknown")].index,inplace=True)

In [5]:
data.loc[(data["city"] == "unknown")]

Empty DataFrame
Columns: [price, restaurant_id, orderable_id, orderable_name, order_id, amount_of_item, order_item_id, creation_date_order, customer_id, opening_hours, city, restaurant_creation_date, street, email, phone_number, restaurant_name, real_price, day_of_week, day_name, day_of_month, day_of_year, month, month_name, year, week]
Index: []

[0 rows x 25 columns]

In [6]:
data = request.big_data
data.loc[:,"city"].unique()

array(['San Francisco', 'New York'], dtype=object)

In [7]:
data = request.big_data
data = data.loc[(data["city"] == "San Frasisco") & (data["year"] == 2017)]
data.count()["order_id"]

0

In [8]:
data = request.big_data
data = data.loc[(data["city"] == "San Frasisco") & (data["year"] == 2017)]
data

Empty DataFrame
Columns: [price, restaurant_id, orderable_id, orderable_name, order_id, amount_of_item, order_item_id, creation_date_order, customer_id, opening_hours, city, restaurant_creation_date, street, email, phone_number, restaurant_name, real_price, day_of_week, day_name, day_of_month, day_of_year, month, month_name, year, week]
Index: []

[0 rows x 25 columns]

In [9]:
data = request.big_data
data = data.loc[(data["city"] == "San Francisco") & (data["year"] == 2019)]
data.count()["order_id"]

27067

In [10]:
request.get_number_order_by_city_by_year("San Francisco",2018)

88634

In [11]:
data = request.big_data
data

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
0,17.122222,244,1613,Peach tart,145486,3,395579,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,51.366667,2,Wednesday,19,353,12,December,2018,51
1,24.600000,244,1611,San Pellegrino Sparkling Water,145486,2,395576,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,49.200000,2,Wednesday,19,353,12,December,2018,51
2,22.500000,244,1606,Cinnamon Raisin Danish ...1.60,145486,1,395577,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,22.500000,2,Wednesday,19,353,12,December,2018,51
3,26.300000,244,1612,Steak Tartare - with quail egg,145486,2,395578,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,52.600000,2,Wednesday,19,353,12,December,2018,51
4,17.122222,244,1613,Peach tart,95543,3,259604,2018-06-30 15:09:00,6359,13:00-23:00,...,S.S. Constitution,51.366667,5,Saturday,30,181,6,June,2018,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486026,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,141930,1,385873,2018-12-07 21:53:00,7963,13:00-23:00,...,Harvard University,22.200000,4,Friday,7,341,12,December,2018,49
486027,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,60294,1,164039,2018-02-18 18:00:00,5235,13:00-23:00,...,Harvard University,22.200000,6,Sunday,18,49,2,February,2018,7
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46
486029,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,137324,1,373340,2018-11-23 15:11:00,24557,13:00-23:00,...,Harvard University,22.200000,4,Friday,23,327,11,November,2018,47
486030,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,71570,1,194633,2018-04-02 20:17:00,17064,13:00-23:00,...,Harvard University,22.200000,0,Monday,2,92,4,April,2018,14

In [12]:
data.columns

Index(['price', 'restaurant_id', 'orderable_id', 'orderable_name', 'order_id',
       'amount_of_item', 'order_item_id', 'creation_date_order', 'customer_id',
       'opening_hours', 'city', 'restaurant_creation_date', 'street', 'email',
       'phone_number', 'restaurant_name', 'real_price', 'day_of_week',
       'day_name', 'day_of_month', 'day_of_year', 'month', 'month_name',
       'year', 'week'],
      dtype='object')

In [13]:
data["orderable_name"].value_counts()

Braised Pork Loin stuffed with sweet sausage and served with artichoke and zucchini    1276
Unfiltered Apple Juice                                                                 1225
Shrimp Cocktail                                                                        1210
Cabernet Sauvignon, Duckhorn, 1986. (Napa Valley)                                      1200
Onion Soup GratinÃƒÂ©e                                                                 1186
                                                                                       ...
Perrier Jouet                                                                             3
CAVIAR with Chopped Egg                                                                   3
Pistachio and Strawberry Tart, Sour Cream and Kirsch Ice Cream                            3
Shrimp w. Black Bean Sauce                                                                2
Handcut French Fries                                                                      2
Name: orderable_name, Length: 1424, dtype: int64

In [14]:
city_group = data.groupby(["city"])
city_year_group = data.groupby(["city","year"])

In [15]:
city_year_group.get_group(("New York",2017))["restaurant_name"].value_counts()

Norge Hotel                                  1378
Billiard Pool And Bowling Tournament         1324
Societe Nationale De Poudres Et Explosifs    1232
Waldorf Hotel                                1163
The Lyric Theatre                            1111
                                             ...
Dr. H. G. Sherman                              36
Simpson Timber                                 29
South Shore Country Club                       16
The Florida Brewing Co.                        13
Ideal Dining And Lunch Room                     8
Name: restaurant_name, Length: 183, dtype: int64

In [16]:
year_for_city_group = city_group.get_group("New York").groupby("year")
new_data = year_for_city_group.get_group(2017)
new_data["restaurant_name"].value_counts()

Norge Hotel                                  1378
Billiard Pool And Bowling Tournament         1324
Societe Nationale De Poudres Et Explosifs    1232
Waldorf Hotel                                1163
The Lyric Theatre                            1111
                                             ...
Dr. H. G. Sherman                              36
Simpson Timber                                 29
South Shore Country Club                       16
The Florida Brewing Co.                        13
Ideal Dining And Lunch Room                     8
Name: restaurant_name, Length: 183, dtype: int64

In [18]:
data["creation_date_order"].value_counts()

2018-09-30 16:21:00    19
2018-10-18 14:45:00    17
2018-06-15 19:08:00    16
2018-06-19 08:33:00    16
2019-01-27 15:14:00    16
                       ..
2018-12-23 17:31:00     1
2018-04-25 19:08:00     1
2019-02-14 20:34:00     1
2017-04-12 14:23:00     1
2018-04-02 20:17:00     1
Name: creation_date_order, Length: 153304, dtype: int64

In [19]:
data["opening_hours"].unique()

array(['13:00-23:00', '08:00-12:00', '12:00-23:00', '12:00-20:00',
       '08:00-21:00'], dtype=object)

In [20]:
data = request.big_data
data = data[["order_id","price","real_price","restaurant_name","city","day_of_month","month","year","creation_date_order"]]
data

,order_id,price,real_price,restaurant_name,city,day_of_month,month,year,creation_date_order
0,145486,17.122222,51.366667,S.S. Constitution,San Francisco,19,12,2018,2018-12-19 18:03:00
1,145486,24.600000,49.200000,S.S. Constitution,San Francisco,19,12,2018,2018-12-19 18:03:00
2,145486,22.500000,22.500000,S.S. Constitution,San Francisco,19,12,2018,2018-12-19 18:03:00
3,145486,26.300000,52.600000,S.S. Constitution,San Francisco,19,12,2018,2018-12-19 18:03:00
4,95543,17.122222,51.366667,S.S. Constitution,San Francisco,30,6,2018,2018-06-30 15:09:00
...,...,...,...,...,...,...,...,...,...
486026,141930,22.200000,22.200000,Harvard University,New York,7,12,2018,2018-12-07 21:53:00
486027,60294,22.200000,22.200000,Harvard University,New York,18,2,2018,2018-02-18 18:00:00
486028,36661,22.200000,22.200000,Harvard University,New York,18,11,2017,2017-11-18 15:01:00
486029,137324,22.200000,22.200000,Harvard University,New York,23,11,2018,2018-11-23 15:11:00
486030,71570,22.200000,22.200000,Harvard University,New York,2,4,2018,2018-04-02 20:17:00

In [21]:
data.groupby(["order_id","creation_date_order"])["real_price"].agg(["sum","mean","max"])

                                sum       mean   max
order_id creation_date_order
0        2017-04-03 14:20:00  182.4  60.800000  83.1
1        2017-04-03 14:53:00  188.5  62.833333  87.3
2        2017-04-03 15:12:00   94.4  47.200000  58.2
3        2017-04-03 15:37:00  166.1  55.366667  83.1
4        2017-04-03 16:33:00   83.1  83.100000  83.1
...                             ...        ...   ...
178719   2019-03-31 22:50:00  155.1  77.550000  90.3
178720   2019-03-31 22:51:00   48.7  24.350000  29.5
178721   2019-03-31 22:55:00  204.0  51.000000  77.7
178722   2019-03-31 22:58:00  113.8  56.900000  93.9
178723   2019-03-31 22:59:00  222.1  55.525000  72.0

[176914 rows x 3 columns]

In [22]:
data["real_price"] = data.groupby("order_id")["real_price"].sum()

/tmp/ipykernel_183659/1728975910.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data["real_price"] = data.groupby("order_id")["real_price"].sum()

In [23]:
data.groupby("order_id").sum()

          price  real_price  day_of_month  month  year
order_id
0          68.3         0.0             9     12  6051
1          74.9         0.0             9     12  6051
2          47.2         0.0             6      8  4034
3          69.2         0.0             9     12  6051
4          27.7         0.0             3      4  2017
...         ...         ...           ...    ...   ...
178719     62.5       319.4            62      6  4038
178720     48.7       122.1            62      6  4038
178721    120.2       595.9           124     12  8076
178722     51.2       313.8            62      6  4038
178723    128.5         0.0           124     12  8076

[176914 rows x 5 columns]

In [24]:
data = request.big_data
city_group = data.groupby(["city"])

In [25]:
data.columns

Index(['price', 'restaurant_id', 'orderable_id', 'orderable_name', 'order_id',
       'amount_of_item', 'order_item_id', 'creation_date_order', 'customer_id',
       'opening_hours', 'city', 'restaurant_creation_date', 'street', 'email',
       'phone_number', 'restaurant_name', 'real_price', 'day_of_week',
       'day_name', 'day_of_month', 'day_of_year', 'month', 'month_name',
       'year', 'week'],
      dtype='object')

In [26]:
new_data = city_group[["order_id","creation_date_order","month","year"]].get_group("New York").groupby(["order_id","month","year"],as_index=False)["creation_date_order"].value_counts()

In [27]:
data = request.big_data
city_group = data.groupby(["city"])
new_data = city_group[["order_id","creation_date_order","month","year","city"]].get_group("New York").groupby(["order_id","month","year","city"],as_index=False)["creation_date_order"].value_counts()
new_data = new_data.sort_values("creation_date_order",ascending=False)
new_data

        order_id  month  year      city  creation_date_order  count
123715    178723      3  2019  New York  2019-03-31 22:59:00      4
123714    178721      3  2019  New York  2019-03-31 22:55:00      4
123713    178720      3  2019  New York  2019-03-31 22:51:00      2
123712    178719      3  2019  New York  2019-03-31 22:50:00      2
123711    178718      3  2019  New York  2019-03-31 22:49:00      2
...          ...    ...   ...       ...                  ...    ...
4              4      4  2017  New York  2017-04-03 16:33:00      1
3              3      4  2017  New York  2017-04-03 15:37:00      3
2              2      4  2017  New York  2017-04-03 15:12:00      2
1              1      4  2017  New York  2017-04-03 14:53:00      3
0              0      4  2017  New York  2017-04-03 14:20:00      3

[123716 rows x 6 columns]

In [28]:
data = request.big_data

In [29]:
data

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
0,17.122222,244,1613,Peach tart,145486,3,395579,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,51.366667,2,Wednesday,19,353,12,December,2018,51
1,24.600000,244,1611,San Pellegrino Sparkling Water,145486,2,395576,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,49.200000,2,Wednesday,19,353,12,December,2018,51
2,22.500000,244,1606,Cinnamon Raisin Danish ...1.60,145486,1,395577,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,22.500000,2,Wednesday,19,353,12,December,2018,51
3,26.300000,244,1612,Steak Tartare - with quail egg,145486,2,395578,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,52.600000,2,Wednesday,19,353,12,December,2018,51
4,17.122222,244,1613,Peach tart,95543,3,259604,2018-06-30 15:09:00,6359,13:00-23:00,...,S.S. Constitution,51.366667,5,Saturday,30,181,6,June,2018,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486026,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,141930,1,385873,2018-12-07 21:53:00,7963,13:00-23:00,...,Harvard University,22.200000,4,Friday,7,341,12,December,2018,49
486027,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,60294,1,164039,2018-02-18 18:00:00,5235,13:00-23:00,...,Harvard University,22.200000,6,Sunday,18,49,2,February,2018,7
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46
486029,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,137324,1,373340,2018-11-23 15:11:00,24557,13:00-23:00,...,Harvard University,22.200000,4,Friday,23,327,11,November,2018,47
486030,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,71570,1,194633,2018-04-02 20:17:00,17064,13:00-23:00,...,Harvard University,22.200000,0,Monday,2,92,4,April,2018,14

In [30]:
order_group = data[["order_id","real_price","restaurant_name"]].groupby("order_id",as_index=False)

In [41]:
restaurant = order_group.value_counts()[["restaurant_name","count"]].groupby("restaurant_name",as_index=False).sum().sort_values("count",ascending=False).head(10)
restaurant.rename(columns={"restaurant_name":"Restaurant"},inplace=True)
restaurant.rename(columns={"count":"Number of order"},inplace=True)

In [42]:
restaurant

                                    Restaurant  Number of order
225                                Norge Hotel             4148
26        Billiard Pool And Bowling Tournament             3124
243                                  Park Lane             3100
309           Society Of Medical Jurisprudence             3067
351                          The Lyric Theatre             2957
306  Societe Nationale De Poudres Et Explosifs             2948
302                                    Sherrys             2945
161                                Junket Club             2926
128                                Hotel Cecil             2884
393                              Waldorf Hotel             2823

In [48]:
data = request.big_data
#data.drop((data[data["city"] == "unknown"].columns))
data["city"].unique()

array(['San Francisco', 'New York'], dtype=object)

In [49]:
data = request.big_data
data

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
0,17.122222,244,1613,Peach tart,145486,3,395579,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,51.366667,2,Wednesday,19,353,12,December,2018,51
1,24.600000,244,1611,San Pellegrino Sparkling Water,145486,2,395576,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,49.200000,2,Wednesday,19,353,12,December,2018,51
2,22.500000,244,1606,Cinnamon Raisin Danish ...1.60,145486,1,395577,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,22.500000,2,Wednesday,19,353,12,December,2018,51
3,26.300000,244,1612,Steak Tartare - with quail egg,145486,2,395578,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,52.600000,2,Wednesday,19,353,12,December,2018,51
4,17.122222,244,1613,Peach tart,95543,3,259604,2018-06-30 15:09:00,6359,13:00-23:00,...,S.S. Constitution,51.366667,5,Saturday,30,181,6,June,2018,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486026,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,141930,1,385873,2018-12-07 21:53:00,7963,13:00-23:00,...,Harvard University,22.200000,4,Friday,7,341,12,December,2018,49
486027,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,60294,1,164039,2018-02-18 18:00:00,5235,13:00-23:00,...,Harvard University,22.200000,6,Sunday,18,49,2,February,2018,7
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46
486029,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,137324,1,373340,2018-11-23 15:11:00,24557,13:00-23:00,...,Harvard University,22.200000,4,Friday,23,327,11,November,2018,47
486030,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,71570,1,194633,2018-04-02 20:17:00,17064,13:00-23:00,...,Harvard University,22.200000,0,Monday,2,92,4,April,2018,14

In [79]:
data = request.big_data
year_group = data.groupby("year",as_index=False)
city_year_group = year_group.get_group(2017).groupby("city")
new_data = city_year_group.get_group("New York")
new_data = new_data.groupby("order_id",as_index=False).[["order_id","real_price","restaurant_name","year","month"]].value_counts()
new_data = new_data.loc[:,["order_id","restaurant_name"]].value_counts().groupby("restaurant_name").sum()
new_data.sort_values(ascending=False).head(10)

AttributeError: 'DataFrameGroupBy' object has no attribute 'loc'

In [77]:
new_data.index

Index(['(Fifth Avenue Hotel?}', 'Agora', 'Alpha Deuteron Phi Gamma Delta',
       'Alumni Association Of Public School No.26',
       'American Spool Cotton Manufacturers Association', 'Amity Hall Inn',
       'Assembly', 'Associates Of The Enginer Corps And Company K',
       'Associates Of The Interborough Rapid Transit Co.', 'Au Chat Noir',
       ...
       'Volapukakluba Nolumelopik', 'Volks Restaurant',
       'Waldorf Astoria Hotel', 'Waldorf Hotel',
       'Warrant Officers Of The U.S. North Atlantic Squadron',
       'Washington Association Of Bowdoin Alumni',
       'Western Reserve University', 'Winthrop Hotel',
       'Yale Alumni Association', '[Restaurant And/Or Location Not Given]'],
      dtype='object', name='restaurant_name', length=183)

restaurant_name
(Fifth Avenue Hotel?}                              685
Agora                                              625
Alpha Deuteron Phi Gamma Delta                     817
Alumni Association Of Public School No.26          313
American Spool Cotton Manufacturers Association     51
                                                  ...
Washington Association Of Bowdoin Alumni            89
Western Reserve University                         221
Winthrop Hotel                                     536
Yale Alumni Association                            474
[Restaurant And/Or Location Not Given]             503
Length: 183, dtype: int64

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
1017,28.224527,260,1711,Avocat aux Crevettes avocado and shrimp salad ...,24528,3,67386,2017-10-01 14:02:00,1550,13:00-23:00,...,Friends Of Mr. Arthur J. Okeeffe,84.673581,6,Sunday,1,274,10,October,2017,39
1025,28.224527,260,1711,Avocat aux Crevettes avocado and shrimp salad ...,30168,3,82575,2017-10-23 21:01:00,3645,13:00-23:00,...,Friends Of Mr. Arthur J. Okeeffe,84.673581,0,Monday,23,296,10,October,2017,43
1026,28.300000,260,1710,Kung Po Shrimp,30168,3,82574,2017-10-23 21:01:00,3645,13:00-23:00,...,Friends Of Mr. Arthur J. Okeeffe,84.900000,0,Monday,23,296,10,October,2017,43
1051,28.224527,260,1711,Avocat aux Crevettes avocado and shrimp salad ...,41800,3,114031,2017-12-08 21:37:00,5320,13:00-23:00,...,Friends Of Mr. Arthur J. Okeeffe,84.673581,4,Friday,8,342,12,December,2017,49
1052,20.000000,260,1713,"Cotes du Rhone, Rasteau, J. Bressy, 1998 (Rhone)",41800,1,114032,2017-12-08 21:37:00,5320,13:00-23:00,...,Friends Of Mr. Arthur J. Okeeffe,20.000000,4,Friday,8,342,12,December,2017,49
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486004,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,40976,3,111778,2017-12-05 15:36:00,8749,13:00-23:00,...,Harvard University,66.600000,1,Tuesday,5,339,12,December,2017,49
486008,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,21950,3,60389,2017-09-18 14:38:00,3694,13:00-23:00,...,Harvard University,66.600000,0,Monday,18,261,9,September,2017,38
486017,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,31153,2,85212,2017-10-27 18:56:00,2901,13:00-23:00,...,Harvard University,44.400000,4,Friday,27,300,10,October,2017,43
486020,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,32289,2,88258,2017-10-31 21:58:00,3532,13:00-23:00,...,Harvard University,44.400000,1,Tuesday,31,304,10,October,2017,44
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46